import Img1 from"../../img/pimg.png"
import Img2 from"../../img/pimg_1.png"
import Img3 from"../../img/pimg_2.png"
import LinkIcon from "../../img/linkimg.png"

function Rules(){
    return(
        <div id="rulesMainDiv">
            <h1>Правила за полагање</h1>
            <section>
                <div>
                    <p className="paragraphs">За стекнување возачка дозвола кандидатот мора успешно да ги заврши трите делови од полагањето:
                        теоретски дел, полигон и практичен дел. Секој дел е засебен и се закажува со избирање на термин и уплаќање на потребната сума.
                    </p>
                    <h2 className="paragraphHeader">Теоретски дел од испитот</h2>
                    <p className="paragraphs">На теоретскиот дел од возачкиот испит се утврдува дали кандидатот за возач ги
                        совладал содржините предвидени во Програмата за оспособување на кандидати за возачи на моторни
                        возила од теоретскиот дел која се спроведува во автошколите. Теоретскиот дел од испитот се полага
                        писмено по пат на тестирање. Тестирањето трае 60 минути, но кандидатот може да го реши тестот и за
                        пократко време. Ќе се смета дека кандидатот го положил испитот доколку освои најмалку 90% од
                        вкупниот број предвидени позитивни поени или не направи повеќе од 10% од вкупниот број
                        предвидени
                        негативни поени. По завршувањето на тестот веднаш ќе бидете известени за резултатите од
                        тестирањето.
                    </p>
                    <a href="#" className="linkToRules"><span><img src={LinkIcon} alt="icon" width="18px" height="18px"/></span>Тестови за возачка дозвола</a><br/>
                    <a href="#" className="linkToRules"><span><img src={LinkIcon} alt="icon" width="18px" height="18px"/></span>Тестови за возачка дозвола-со одговори</a>
                </div>
                <div className="imgDivR">
                    <img src={Img1} alt="example test img" width="600px" height="300px"/>
                </div>
            </section>
            <section>
                <div className="imgDivL">
                    <img src={Img2} alt="example" width="600px" height="300px"/>
                </div>
                <div>
                    <h2 className="paragraphHeader">Полигон</h2>
                    <p className="paragraphs">Полигон На првиот практичен дел од испитот како кандидат за возач, кандидатот треба да покаже
                        дека
                        може да го подготви возилото за возење и со истото правилно да ги изведувате следните дејствија:
                        поаѓање со возило од место, одржување на правец на движење напред со менување на степени на
                        пренос
                        на една сообраќајна лента и запирање на возилото на безбеден и пропишан начин; возење со
                        возилото назад
                        по една сообраќајна лента; полукружно свртување; паркирање со возило и запирање и поаѓање со
                        возилото на
                        површина на угорнина со употреба на помошна сопирачка.
                    </p>

                    <p className="paragraphs"> Кандидатот успешно ќе го положи испитот доколку не направи повеќе од 50 негативни поени. Повеќе
                        за доделувањето на
                        негативните поени може да погледнете во правилникот подолу.</p>
                    <a href="#" className="linkToRules"><span><img src={LinkIcon} alt="icon" width="18px" height="18px"/></span>Правилник за начинот на спроведување на
                        возачките испити и критериумите</a>
                </div>

            </section>
            <section>
                <div>
                    <h2 className="paragraphHeader">Практичен дел - градска</h2>
                    <p className="paragraphs">На вториот практичен дел од испитот кандидатот ќе треба да покаже дека поседува практично знаење
                        и потребна вештина за самостојно и безбедно управување со моторно возило на пат. За време на
                        испитот, испитната комисија на кандидатот му го одредува правецот и ќе му ги кажува насоките на
                        движење со возилото. Комисијата следи на кој начин кандидатот управува со возилото се додека не
                        се увери дека го поседува потребното знаење и вештини за самостојно и безбедно управување со
                        моторно возило во сообраќај на пат. Последниот дел од возачкиот испит за управување со моторно
                        возило е временски ограничен, на начин што истиот е лимитиран со временска рамка и трае не
                        помалку од 15 минути, а не подолго од 40 минути. За евентуално неправилно извршените дејствија
                        испитната комисија води посебни оценувачки листи во кои ги бележи утврдените негативните поени.
                        Доколку кандидатот не направи повеќе од 50 негативни поени ќе се смета дека го положил практичниот
                        дел од возачкиот испит. Вот екот на полагањето на испитот испитната комисија води и записник.</p>
                    <a href="#" className="linkToRules"><span><img src={LinkIcon} alt="icon" width="18px" height="18px"/></span>Правилник за начинот на спроведување на
                        возачките испити и критериумите</a>
                </div>
                <div className="imgDivR">
                    <img src={Img3} alt="img" width="600px" height="300px"/>
                </div>
            </section>
        </div>
    )
}

export default Rules;